<?xml version="1.0" encoding="utf-8"?>
<!-- Copyright (c) Microsoft Corporation.
     Licensed under the MIT License. -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.5" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>PowerToys</displayName>
  <description>PowerToys</description>
  <resources>
    <stringTable>
      <string id="PowerToys">Microsoft PowerToys</string>
	  <string id="InstallerUpdates">Installer and Updates</string>
	  <string id="PowerToysRun">PowerToys Run</string>

      <string id="SUPPORTED_POWERTOYS_0_64_0">PowerToys version 0.64.0 or later</string>
      <string id="SUPPORTED_POWERTOYS_0_68_0">PowerToys version 0.68.0 or later</string>
      <string id="SUPPORTED_POWERTOYS_0_69_0">PowerToys version 0.69.0 or later</string>
      <string id="SUPPORTED_POWERTOYS_0_70_0">PowerToys version 0.70.0 or later</string>
      <string id="SUPPORTED_POWERTOYS_0_73_0">PowerToys version 0.73.0 or later</string>
      <string id="SUPPORTED_POWERTOYS_0_75_0">PowerToys version 0.75.0 or later</string>

            <string id="ConfigureGlobalUtilityEnabledStateDescription">This policy configures the enabled state for all PowerToys utilities.

If you enable this setting, all utilities will be always enabled and the user won't be able to disable it.

If you disable this setting, all utilities will be always disabled and the user won't be able to enable it.

If you don't configure this setting, users are able to disable or enable the utilities.

The individual enabled state policies for the utilities will override this policy.
</string>

	  <string id="ConfigureEnabledUtilityDescription">This policy configures the enabled state for a PowerToys utility.

If you enable this setting, the utility will be always enabled and the user won't be able to disable it.

If you disable this setting, the utility will be always disabled and the user won't be able to enable it.

If you don't configure this setting, users are able to disable or enable the utility.

This policy has a higher priority than the policy "Configure global utility enabled state" and overrides it.
</string>
      <string id="ConfigureEnabledUtilityDescriptionPDFPreviewHandler">(Note: There have been reports of incompatibility between the PDF Preview Handler and Outlook)

This policy configures the enabled state for a PowerToys utility.

If you enable this setting, the utility will be always enabled and the user won't be able to disable it.

If you disable this setting, the utility will be always disabled and the user won't be able to enable it.

If you don't configure this setting, users are able to disable or enable the utility.

This policy has a higher priority than the policy "Configure global utility enabled state" and overrides it.
</string>
      <string id="DisablePerUserInstallationDescription">This policy configures whether per-user PowerToys installation is allowed or not.

If enabled, per-user installation is not allowed.

If disabled or not configured, per-user installation is allowed.
</string>
      <string id="DisableAutomaticUpdateDownloadDescription">This policy configures whether automatic downloads of available updates are disabled or not. (On metered connections updates are never downloaded.)

If enabled, automatic downloads are disabled.

If disabled or not configured, the user is in control of automatic downloads setting.
</string>
      <string id="SuspendNewUpdateToastDescription">This policy configures whether the action center notification for new updates is suspended for 2 minor releases. (Example: if the installed version is v0.60.0, then the next notification is shown for the v0.63.* release.)

If enabled, the notification is suspended.

If disabled or not configured, the notification is shown.

Note: The notification about new major versions is always displayed.
</string>
      <string id="DisablePeriodicUpdateCheckDescription">This policy allows you to disable automatic update checks running in the background. (The manual check in PT Settings is not affected by this policy.)

If enabled, the automatic update checks are disabled.

If disabled or not configured, the automatic update checks are enabled.
</string>
      <string id="AllowExperimentationDescription">This policy configures whether PowerToys experimentation is allowed. With experimentation allowed the user sees the new features being experimented if it gets selected as part of the test group. (Experimentation will only happen on Windows Insider builds.)

If this setting is not configured or enabled, the user can control experimentation in the PowerToys settings menu.

If this setting is disabled, experimentation is not allowed.
</string>
      <string id="PowerToysRunAllPluginsEnabledStateDescription">This policy configures the enabled state for all PowerToys Run plugins. All plugins will have the same state.

If you enable this setting, the plugins will be always enabled and the user won't be able to disable it.

If you disable this setting, the plugins will be always disabled and the user won't be able to enable it.

If you don't configure this setting, users are able to disable or enable the plugins.

You can override this policy for individual plugins using the policy "Configure enabled state for individual plugins".

Note: Changes require a restart of PowerToys Run.
</string>
      <string id="PowerToysRunIndividualPluginEnabledStateDescription">With this policy you can configures an individual enabled state for each PowerToys Run plugin that you add to the list.

If you enable this setting, you can define the list of plugins and their enabled states:
  - The value name (first column) is the plugin ID. You will find it in the plugin.json which is located in the plugin folder.
  - The value (second column) is a numeric value: 0 for disabled, 1 for enabled and 2 for user takes control.
  - Example to disable the Program plugin: 791FC278BA414111B8D1886DFE447410 | 0

If you disable or don't configure this policy, either the user or the policy "Configure enabled state for all plugins" takes control over the enabled state of the plugins.

You can set the enabled state for all plugins not listed here using the policy "Configure enabled state for all plugins".

Note: Changes require a restart of PowerToys Run.
</string>
      <string id="ConfigureGlobalUtilityEnabledState">Configure global utility enabled state</string>
      <string id="ConfigureEnabledUtilityAlwaysOnTop">Always On Top: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityAwake">Awake: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityColorPicker">Color Picker: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityCropAndLock">Crop And Lock: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityEnvironmentVariables">Environment Variables: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFancyZones">FancyZones: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileLocksmith">File Locksmith: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerSVGPreview">SVG file preview: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerMarkdownPreview">Markdown file preview: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerMonacoPreview">Source code file preview: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerPDFPreview">PDF file preview: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerGcodePreview">Gcode file preview: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerSVGThumbnails">SVG file thumbnail: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerPDFThumbnails">PDF file thumbnail: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerGcodeThumbnails">Gcode file thumbnail: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerSTLThumbnails">STL file thumbnail: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityHostsFileEditor">Hosts file editor: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityImageResizer">Image Resizer: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityKeyboardManager">Keyboard Manager: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFindMyMouse">Find My Mouse: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityMouseHighlighter">Mouse Highlighter: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityMouseJump">Mouse Jump: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityMousePointerCrosshairs">Mouse Pointer Crosshairs: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityMouseWithoutBorders">Mouse Without Borders: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityPastePlain">Paste as Plain Text: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityPeek">Peek: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityPowerRename">Power Rename: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityPowerLauncher">PowerToys Run: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityQuickAccent">Quick Accent: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityRegistryPreview">Registry Preview: Configure enabled state</string>		
      <string id="ConfigureEnabledUtilityScreenRuler">Screen Ruler: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityShortcutGuide">Shortcut Guide: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityTextExtractor">Text Extractor: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityVideoConferenceMute">Video Conference Mute: Configure enabled state</string>
      <string id="DisablePerUserInstallation">Disable per-user installation</string>
      <string id="DisableAutomaticUpdateDownload">Disable automatic downloads</string>
      <string id="SuspendNewUpdateToast">Suspend Action Center notification for new updates</string>
      <string id="DisablePeriodicUpdateCheck">Disable automatic update checks</string>
      <string id="AllowExperimentation">Allow Experimentation</string>
      <string id="PowerToysRunAllPluginsEnabledState">Configure enabled state for all plugins</string>
      <string id="PowerToysRunIndividualPluginEnabledState">Configure enabled state for individual plugins</string>
      <string id="ConfigureEnabledUtilityFileExplorerQOIPreview">QOI file preview: Configure enabled state</string>
      <string id="ConfigureEnabledUtilityFileExplorerQOIThumbnails">QOI file thumbnail: Configure enabled state</string>
    </stringTable>
	
	<presentationTable>
	  <presentation id="PowerToysRunIndividualPluginEnabledState">
        <listBox refId="PowerToysRunIndividualPluginEnabledList">List of managed plugins:</listBox>
      </presentation>
	</presentationTable>
	
  </resources>
</policyDefinitionResources>

