Repository: microsoft/PowerToys
Catalog: src/runner/Resources.*.resx
Languages: vi

# ERROR
source: PowerToys Error
vi: Lỗi PowerToys

# COULDNOT_RESTART_NONELEVATED
source: Could not start PowerToys as a user!
vi: Không thể khởi động PowerToys với tư cách người dùng!

# COULDNOT_RESTART_ELEVATED
source: Could not start PowerToys as an administrator!
vi: Không thể khởi động PowerToys với quyền quản trị!

# ANOTHER_INSTANCE_RUNNING
source: PowerToys is already running.
vi: PowerToys hiện đang chạy.

# AUTOUPDATE_SUCCESS
source: PowerToys was successfully updated!
vi: PowerToys đã được cập nhật thành công!

# MSI_VERSION_IS_ALREADY_RUNNING
source: An older version of PowerToys is already running.
vi: Phiên bản PowerToys cũ hơn đang chạy.

# DOWNLOAD_UPDATE_ERROR
source: Couldn't download PowerToys update! Please report the issue on GitHub.
vi: Không thể tải xuống bản cập nhật PowerToys! Vui lòng báo sự cố trên GitHub.

# OLDER_MSIX_UNINSTALLED
source: An older MSIX version of PowerToys was uninstalled.
vi: Phiên bản MSIX cũ hơn của PowerToys đã được gỡ cài đặt.

# PT_UPDATE_MESSAGE_BOX_TEXT
source: PowerToys was updated successfully!
vi: PowerToys đã được cập nhật thành công!

# STARTUP_DISABLED_BY_POLICY
source: This setting has been disabled by your administrator.
vi: Cài đặt này đã bị quản trị viên vô hiệu hóa.

# STARTUP_DISABLED_BY_USER
source: This setting has been disabled manually via <a href="https://ms_settings_startupapps" target="_blank">Startup Settings</a>.
vi: Cài đặt này đã bị vô hiệu hóa thủ công qua <a href="https://ms_settings_startupapps" target="_blank">Cài đặt Khởi động</a>.

# GITHUB_NEW_VERSION_AVAILABLE
source: An update to PowerToys is available.
vi: Đã có bản cập nhật cho PowerToys.

# GITHUB_NEW_VERSION_UPDATE_NOW
source: Update now
vi: Cập nhật ngay

# GITHUB_NEW_VERSION_AVAILABLE_OFFER_VISIT
source: An update to PowerToys is available. Visit our GitHub page to update.
vi: Đã có bản cập nhật cho PowerToys. Truy cập trang GitHub của chúng tôi để cập nhật.

# GITHUB_NEW_VERSION_MORE_INFO
source: More info...
vi: Thông tin thêm...

# TOAST_TITLE
source: PowerToys Update
vi: Cập nhật PowerToys

# QUICK_ACCESS_MENU_TEXT
source: Quick access\tLeft-click
vi: Truy cập nhanh\tNhấp chuột trái

# SETTINGS_MENU_TEXT
source: Settings\tDouble-click
vi: Cài đặt\tNhấp đúp chuột

# DOCUMENTATION_MENU_TEXT
source: Documentation
vi: Tài liệu

# SUBMIT_BUG_TEXT
source: Report bug
vi: Báo cáo lỗi

# BUGREPORT_SUCCESS
source: Bug report .zip file has been created on your Desktop.
vi: Tệp .zip báo cáo lỗi đã được tạo trên Màn hình nền của bạn.

# PT_VERSION_CHANGE_ASK_FOR_COMPUTER_RESTART
source: A new PowerToys version has been installed. Please restart the computer, when possible, to fully reload File Explorer extensions.
vi: Phiên bản PowerToys mới đã được cài đặt. Vui lòng khởi động lại máy tính khi có thể để tải lại hoàn toàn các tiện ích mở rộng File Explorer.

# TRAY_ICON_ADMIN_TOOLTIP
source: Administrator
vi: Quản trị viên
